namespace HengDa.LiZongMing.REAMS
{
    public enum HDNBSCmdCode : byte
    {

        采样启停控制 = 0xF0, //气碘中为开始采样，现在不用传入采样方式，直接传入参数[启动\停止\暂停]
        时间设置 = 0x60,//
        NBS运行模式设置=0x62,
        滤膜编号设定 = 0x64,
        采样流量设定 = 0x30,//气碘中为采样瞬时流量设定；
        采样时长设定 = 0x40,//气碘中为采样时间设定
        采样体积设定 = 0x50,//气碘中为定量采样量设定，意义一样
        运行状态查询 = 0xC0,//气碘中为工作状态查询，意义一样
        设定值查询 = 0x80,//气碘中为设置信息查询
        NBS剩余时间=0x82,
        NBS剩余体积 = 0x84,
        NBS运行模式查询 = 0x86,
        NBS运行开始时间 = 0x89,
        瞬时数据查询 = 0xD0,
        文件号查询 = 0xA0,
        读取文件 = 0xB0,
        报警记录查询 = 0x70,//气碘为故障查询
    }
}